// Найти сумму чисел от 1 до А
Console.WriteLine("Введите число: ");
int n = int.Parse(Console.ReadLine() ?? "0");
int f = 1;
int i = 1;
while(i<=n)
{
    Console.WriteLine(f=f*i)
    i++;
}
